const {cmd , commands} = require('../command')

cmd({
    pattern: "menu",
    desc: "menu the bot",
    category: "menu",
    react: "⚔️",
    filename: __filename
},

async(conn, mek, m,{from, quoted, body, isCmd, command, args, q, isGroup, sender, senderNumber, botNumber2, botNumber, pushname, isMe, isOwner, groupMetadata, groupName, participants, groupAdmins, isBotAdmins, isAdmins, reply}) => {
try{

let dec = `
══════════ ⚔️ ══════════  
                     *ASTA* - *BOT*  
  ══════════ ⚔️ ══════════
> *Runtime*  : ${runtime(process.uptime())}
> *Mode*     : *[${config.MODE}]*
> *Prefix*    : *[${config.PREFIX}]*
> *Ram* : ${(process.memoryUsage().heapUsed / 1024 / 1024).toFixed(2)}MB / ${Math.round(require('os').totalmem / 1024 / 1024)}MB
 
│▸*⚔️* *ᴄʀᴇᴀᴛᴏʀ* : *➺ᴅᴀᴠᴇ
│▸*⚔️* *ᴠᴇʀsɪᴏɴ* : *ᴠ2.1*
│▸*⚔️* *ᴍᴇɴᴜ ᴄᴍᴅ* : *ᴍᴇɴᴜ ʟɪsᴛ*

Quote: let  God be your light and path out of the darkness 

╭────❒ *DOWNLOAD* *MENU*
│⚔️ *ᴍᴇᴅɪᴀғɪʀᴇ*
│⚔️│*.ɪɴꜱᴛᴀ*
│⚔️│*.ᴠɪᴅᴇᴏ*
│⚔️│ *.ɢᴅʀɪᴠᴇ*
│⚔️│ *.ᴛᴡɪᴛᴛᴇʀ*
│⚔️│*.ᴛᴛ*
│⚔️│*.ғʙ*
│⚔️│*.ꜱᴏɴɢ*
│⚔️│*.ᴘʟᴀʏ*
│⚔️│*.ᴠɪᴅᴇᴏ*
│⚔️│*.ᴠɪᴅᴇᴏ2*
│⚔️│*.ɪᴍɢ*
│⚔️│*.ᴀᴘᴋ*
│⚔️│*.ᴅᴀʀᴀᴍᴀ*
│⚔️│*.ᴘʟᴀʏ2*
│⚔️│*.ʙᴀɪsᴄᴏᴘᴇ*
│⚔️ *ɢɪɴɪsɪsɪʟᴀ*
╘─────────

╭────❒*SEARCH MENU* *
│⚔️ *ʏᴛꜱ*
│⚔️│*.ʏᴛᴀ*
│⚔️│*.ʟᴏʟɪ*
│⚔️│*.ᴍᴏᴠɪᴇɪɴғᴏ*
│⚔️│*.ᴍᴏᴠɪᴇ*
│⚔️ *ᴡᴇᴀᴛʜᴇʀ*
╘──────────

╭────❒⁠⁠⁠⁠* *AI MENU* *❒
│⚔️ *ɢᴘᴛ*
│⚔️│*.ᴀɪ*
│⚔️ *ʙᴏᴛ*
╘─────────

╭────❒⁠⁠⁠⁠* *OWNER MENU* *❒
│⚔️ *ᴜᴘᴅᴀᴛᴇᴄᴍᴅ*
│⚔️│*.sᴇᴛᴛɪɴɢs*
│⚔️│*.ᴏᴡɴᴇʀ*
│⚔️│*.ʀᴇᴘᴏ*
│⚔️│*.ꜱʏꜱᴛᴇᴍ*
│⚔️│*.ꜱᴛᴀᴛᴜꜱ*
│⚔️│*.ʙʟᴏᴄᴋ*
│⚔️│*.ᴜɴʙʟᴏᴄᴋ*
│⚔️│*.sʜᴜᴛᴅᴏᴡɴ*
│⚔️│*.ᴄʟᴇᴀʀᴄʜᴀᴛs*
│⚔️│*.sᴇᴛᴘᴘ*
│⚔️│*.ʙʀᴏᴀᴅᴄᴀsᴛ*
│⚔️│*.ᴊɪᴅ*
│⚔️│*.ɢᴊɪᴅ*
│⚔️ *ʀᴇꜱᴛᴀʀᴛ*
╘─────────

╭────❒⁠⁠⁠⁠* *GROUP MENU* *❒
│⚔️ *ʀᴇᴍᴏᴠᴇ*
│⚔️│*.ᴅᴇʟᴇᴛᴇ*
│⚔️│*.ᴀᴅᴅ*
│⚔️│*.ᴋɪᴄᴋ*
│⚔️│*.ᴋɪᴄᴋᴀʟʟ*
│⚔️│*.sᴇᴛɢᴏᴏᴅʙʏᴇ*
│⚔️│*.sᴇᴛᴡᴇʟᴄᴏᴍᴇ*
│⚔️│*.ᴘʀᴏᴍᴏᴛᴇ*
│⚔️│*.ᴅᴇᴍᴏᴛᴇ*
│⚔️│*.ᴛᴀɢᴀʟʟ*
│⚔️│*.ɢᴇᴛᴘɪᴄ*
│⚔️│*.ɪɴᴠɪᴛᴇ*
│⚔️│*.ʀᴇᴠᴏᴋᴇ*
│⚔️│*.ᴊᴏɪɴʀᴇǫᴜᴇsᴛs*
│⚔️│*.ᴀʟʟʀᴇǫ*
│⚔️│*.ᴍᴜᴛᴇ*
│⚔️│*.ᴜɴᴍᴜᴛᴇ*
│⚔️│*.ʟᴏᴄᴋɢᴄ*
│⚔️│*.ᴜɴʟᴏᴄᴋɢᴄ*
│⚔️│*.ʟᴇᴀᴠᴇ*
│⚔️│*.ᴜᴘᴅᴀᴛᴇɢɴᴀᴍᴇ*
│⚔️│*.ᴜᴘᴅᴀᴛᴇɢᴅᴇsᴄ*
│⚔️│*.ᴊᴏɪɴ*
│⚔️│*.ʜɪᴅᴇᴛᴀɢ*
│⚔️│*.ɢɪɴғᴏ*
│⚔️│*.ᴅɪsᴀᴘᴘᴇᴀʀ ᴏɴ*
│⚔️│*.ᴅɪsᴀᴘᴘᴇᴀʀ ᴏғғ*
│⚔️│*.ᴅɪsᴀᴘᴘᴇᴀʀ 7ᴅ 24ʜ 90ᴅ*
│⚔️ *sᴇɴᴅᴅᴍ*
╘─────────

╭────❒⁠⁠⁠⁠* *INFO MENU* *❒
│⚔️ *ᴍᴇɴᴜ*
│⚔️│*.ᴍᴇɴᴜ2*
│⚔️│*.ᴍᴇɴᴜ3*
│⚔️│*.ᴀʙᴏᴜᴛ*
│⚔️│*.sᴄʀɪᴘᴛ*
│⚔️│*.ʀᴇᴘᴏ*
│⚔️│*.ᴋɢᴛᴇᴄʜ*
│⚔️│*.ᴀʟɪᴠᴇ*
│⚔️│*.ʙᴏᴛɪɴꜰᴏ*
│⚔️│*.ꜱᴛᴀᴛᴜꜱ*
│⚔️│*.ꜱᴜᴘᴘᴏʀᴛ*
│⚔️│*.ᴘɪɴɢ*
│⚔️│*.ᴘɪɴɢ2*
│⚔️ *ꜱʏꜱᴛᴇᴍ*
╘─────────

╭────❒⁠⁠⁠⁠* *CONVERTER MENU* *❒⁠⁠⁠⁠* 
│⚔️ *sᴛɪᴄᴋᴇʀ*
│⚔️│*.ᴛʀᴛ*
│⚔️ *ᴛᴛs*
╘─────────

╭────❒⁠⁠⁠⁠* *SPECIAL COMMANDS* *❒⁠⁠⁠⁠* 
│⚔️ *ᴋᴇʀᴍ*
│⚔️│*.ᴅᴏɢ*
│⚔️│*.ᴀɴɪᴍᴇ*
│⚔️│*.ᴀɴɪᴍᴇɢɪʀʟ*
│⚔️│*.ᴀɴɪᴍᴇɢɪʀʟ1*
│⚔️│*.ᴀɴɪᴍᴇɢɪʀʟ2*
│⚔️│*.ᴀɴɪᴍᴇɢɪʀʟ3*
│⚔️│*.ᴀɴɪᴍᴇɢɪʀʟ4*
│⚔️│*.ᴀɴɪᴍᴇɢɪʀʟ5*
│⚔️ *ɪᴍɢ*
╘─────────
╭────❒⁠⁠⁠⁠* *OTHER COMMANDS* *❒⁠⁠⁠⁠* 
│⚔️ *ᴛʀᴛ*
│⚔️│*.ᴊᴏᴋᴇ*
│⚔️│*.ꜰᴀᴄᴛ*
│⚔️│*.ɢɪᴛʜᴜʙ*
│⚔️│*.ɢᴘᴀꜱꜱ*
│⚔️│*.ʜᴀᴄᴋ*
│⚔️│*.ǫᴜᴏᴛᴇ*
│⚔️│*.ꜱʀᴇᴘᴏ*
│⚔️ *ᴅᴇꜰɪɴᴇ*
╘─────────



 _*ASTA MD V2*_
 > © *dave*

`
await conn.sendMessage(from,{image:{url: `https://files.catbox.moe/whar66.jpg`},caption:dec},{quoted:mek});

}catch(e){
console.log(e)
reply(`${e}`)
}
})
